Revit 2027 API
PointCloudOverrides.GetPointCloudScanOverrideSettings(ElementId, String, Document) Method
 Gets override settings assigned to a particular scan within a PointCloudInstance element.
Namespace: Autodesk.Revit.DB.PointClouds
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public PointCloudOverrideSettings GetPointCloudScanOverrideSettings(
	ElementId elementId,
	string scanTag,
	Document doc
)
Public Function GetPointCloudScanOverrideSettings (
	elementId As ElementId,
	scanTag As String,
	doc As Document
) As PointCloudOverrideSettings
public:
PointCloudOverrideSettings^ GetPointCloudScanOverrideSettings(
	ElementId^ elementId,
	String^ scanTag,
	Document^ doc
)
member GetPointCloudScanOverrideSettings :
        elementId : ElementId *
        scanTag : string *
        doc : Document -> PointCloudOverrideSettings
Parameters
elementId ElementId
 Id of the overridden element.
scanTag String
 The tag identifying the particular scan within the PointCloudInstance element. Tags can be obtained from PointCloudInstance via method getScans.
doc Document
 Document containing the overridden element.
Return Value
PointCloudOverrideSettings
 The override settings assigned to the scan, if present, or a default override settings if nothing was found.
Exceptions
Exception | Condition
ArgumentException |  Thrown when supplied scanTag is not empty while doc is NULL
ArgumentNullException |  A non-optional argument was null
See Also
Reference
PointCloudOverrides Class
GetPointCloudScanOverrideSettings Overload
Autodesk.Revit.DB.PointClouds Namespace